reddit_clone/app/views/posts/show.html.erb

<h2><%= @post.title %> by <%= User.find(@post.author_id).username %></h2>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

<h4><b>Subs</b></h4>
<%= Sub.find(@post.sub_id).title %>
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]