reddit_clone/app/controllers/posts_controller.rb

SELECT "subs".* FROM "subs"
---
  def new
    @subs = Sub.all

SELECT "subs".* FROM "subs"
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @subs = Sub.all
    @post = Post.find(params[:id])

INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "asd"], ["url", "asd"], ["content", "asd"], ["sub_id", 2], ["author_id", 7], ["created_at", "2020-11-09 22:46:44.535107"], ["updated_at", "2020-11-09 22:46:44.535107"]]
---
  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id


    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "Cold brew is dabes"], ["content", "COLD BREW ROCKS"], ["updated_at", "2020-11-10 00:21:46.044134"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])

    if @post
      @post.update(post_params)