reddit_clone/app/controllers/subs_controller.rb

    def edit
        @sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

    def update
        @sub = Sub.find(params[:id])
        if @sub
            @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "Puppies rock"], ["updated_at", "2020-11-10 00:22:58.076936"], ["id", 6]]